app/views/websites/index.html.erb

					<% website_category_array = []
						website.categories.to_ary().each do |category_obj|
---
SELECT  "categories".* FROM "categories" INNER JOIN "categories_websites" ON "categories"."id" = "categories_websites"."category_id" WHERE "categories_websites"."website_id" = ?  ORDER BY "categories"."id" ASC LIMIT 1  [["website_id", 1]]