app/controllers/websites_controller.rb

	def index
		@websites = Website.all
		@categories = Category.all
---
SELECT "websites".* FROM "websites"
SELECT "categories".* FROM "categories"